Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If the xref:micrometer.adoc[Micrometer extension] is present, then a `@io.micrometer.core.annotation.Timed` interceptor binding is added to all `@Scheduled` methods automatically (unless it's already present) and a `io.micrometer.core.instrument.Timer` with name `scheduled.methods` and a `io.micrometer.core.instrument.LongTaskTimer` with name `scheduled.methods.running` are registered. The fully qualified name of the declaring class and the name of a `@Scheduled` method are used as tags.
ja_jp: link:micrometer[Micrometer エクステンション] が存在する場合、すべての `@Scheduled` メソッドに `@io.micrometer.core.annotation.Timed` インターセプターバインディングが自動的に追加され (すでに存在している場合を除く)、 `scheduled.methods` という名前の `io.micrometer.core.instrument.Timer` と `scheduled.methods.running` という名前の `io.micrometer.core.instrument.LongTaskTimer` が登録されます。タグとしては、宣言したクラスの完全修飾名と、 `@Scheduled` のメソッド名が使われます。

source: If the xref:opentelemetry.adoc[OpenTelemetry extension] is present, then the Kafka connector channels work out-of-the-box with the OpenTelemetry Tracing. Messages written to Kafka topics propagate the current tracing span. On incoming channels, if a consumed Kafka record contains tracing information the message processing inherits the message span as parent.
ja_jp: xref:opentelemetry.adoc[OpenTelemetry エクステンション] が存在する場合、 Kafka コネクターチャネルは OpenTelemetry Tracing ですぐに使用できます。 Kafka トピックに書き込まれたメッセージは、現在のトレーシング範囲を伝播します。 着信チャネルでは、消費された Kafka レコードにトレーシング情報が含まれている場合、メッセージ処理はメッセージスパンを親として継承します。

source: If the xref:quartz.adoc[Quartz extension] is present and the DB store type is used then it's not possible to pass a task instance to the job definition and a task class must be used instead. The Quartz API can be also used to schedule a job programmatically.
ja_jp: xref:quartz.adoc[Quartz エクステンション] が存在し、DB ストアタイプが使用されている場合、タスクインスタンスをジョブ定義に渡すことはできず、代わりにタスククラスを使用する必要があります。Quartz API を使用して、プログラムでジョブをスケジュールすることもできます。

source: If the xref:quartz.adoc[Quartz extension] is present then the Quartz API can be also used to schedule a job programmatically.
ja_jp: xref:quartz.adoc[Quartz] エクステンションがある場合は、Quartz APIを使用してプログラム的にジョブをスケジュールすることも可能です。

source: If the xref:smallrye-metrics.adoc[SmallRye Metrics extension] is present, then a `@org.eclipse.microprofile.metrics.annotation.Timed` interceptor binding is added to all `@Scheduled` methods automatically (unless it's already present) and a `org.eclipse.microprofile.metrics.Timer` is created for each `@Scheduled` method. The name consists of the fully qualified name of the declaring class and the name of a `@Scheduled` method. The timer has a tag `scheduled=true`.
ja_jp: link:smallrye-metrics[SmallRye Metrics エクステンション]が存在する場合、 `@org.eclipse.microprofile.metrics.annotation.Timed` インターセプターバインディングがすべての `@Scheduled` メソッドに自動的に追加され（すでに存在している場合を除く）、 `org.eclipse.microprofile.metrics.Timer` が各 `@Scheduled` メソッドに対して作成されます。名前は、宣言したクラスの完全修飾名と `@Scheduled` メソッドの名前で構成されます。タイマーには、タグ `scheduled=true` が付いています。

source: If the xref:telemetry-micrometer.adoc[Micrometer extension] is present, then Kafka producer and consumer clients metrics are exposed as Micrometer meters.
ja_jp: xref:telemetry-micrometer.adoc[Micrometer エクステンション] が存在する場合、 Kafka プロデューサーおよびコンシューマークライアントのメトリクスは Micrometer メーターとして公開されます。

source: If the xref:telemetry-micrometer.adoc[Micrometer extension] is present, then a `@io.micrometer.core.annotation.Timed` interceptor binding is added to all `@Scheduled` methods automatically (unless it's already present) and a `io.micrometer.core.instrument.Timer` with name `scheduled.methods` and a `io.micrometer.core.instrument.LongTaskTimer` with name `scheduled.methods.running` are registered. The fully qualified name of the declaring class and the name of a `@Scheduled` method are used as tags.
ja_jp: xref:telemetry-micrometer.adoc[Micrometer エクステンション] が存在する場合、すべての `@Scheduled` メソッドに `@io.micrometer.core.annotation.Timed` インターセプター・バインディングが自動的に追加され (すでに存在する場合を除く)、 `scheduled.methods` という名前の `io.micrometer.core.instrument.Timer` と `scheduled.methods.running` という名前の `io.micrometer.core.instrument.LongTaskTimer` が登録されます。宣言するクラスの修飾子名と `@Scheduled` メソッド名がタグとして使用されます。

source: If there are `@RestForm` parameters that are not multipart-implying, then `@Consumes(MediaType.APPLICATION_FORM_URLENCODED)` is implied.
ja_jp: マルチパートではない `@RestForm` パラメーターがある場合は、 `@Consumes(MediaType.APPLICATION_FORM_URLENCODED)` になります。

source: If there are any problems creating the function, you must delete it with the `delete` function before re-running the `create` command.
ja_jp: Function の作成に問題がある場合は、 `delete` で Function を削除してから `create` コマンドを再実行する必要があります。

source: If there are extensive code changes and documentation changes, create a separate PR for the documentation changes and include the relationship in the issue description.
ja_jp: 広範囲なコード変更とドキュメント変更がある場合、ドキュメント変更のために別のPRを作成し、Issueの説明にその関係性を含めてください。

source: If there are extensive code changes as well as documentation changes, make a separate PR for the documentation changes and indicate the relationship in the issue description.
ja_jp: 大規模なコードの変更とドキュメントの変更がある場合、ドキュメントの変更については別の PR を作成し、PR の説明でその関係を示してください。

source: If there are multiple files for a specific locale then Qute attempts to resolve the ambiguity. Localized files from the application root have higher priority and take precedence over localized files from dependencies. If multiple files of the same priority exist, then the build fails. For example, if the default bundle locale is `en` and the files `msg.properties` and `msg_en.properties` are found in the application root, then an exception is thrown and the build fails. Or another example - if there are two dependencies and both contain the `msg_en.properties` file, then the build fails again. On the other hand, if there is the `msg_en.properties` file in the application root and also the `msg_en.properties` file in a dependency, then messages from the application root take precedence and override the values from the dependency.
ja_jp: 特定のロケールに対して複数のファイルがある場合、Qute は曖昧さを解決しようとします。アプリケーションルートからのローカライズされたファイルは優先度が高く、依存関係からのローカライズされたファイルよりも優先されます。同じ優先度のファイルが複数存在する場合、ビルドは失敗します。例えば、デフォルトのバンドルロケールが `en` で、`msg.properties` と `msg_en.properties` の両方のファイルがアプリケーションルートで見つかった場合、例外がスローされビルドは失敗します。別の例として、2 つの依存関係があり、両方に `msg_en.properties` ファイルが含まれている場合、ビルドは再び失敗します。一方、アプリケーションルートに `msg_en.properties` ファイルがあり、依存関係にも `msg_en.properties` ファイルがある場合、アプリケーションルートからのメッセージが優先され、依存関係からの値を上書きします。

source: If there is a bean class that has no scope and declares at least one non-static method annotated with `@Scheduled` then `@Singleton` is used.
ja_jp: スコープを持たないBeanクラスで、 `@Scheduled` でアノテーションされた非静的メソッドが少なくとも一つ宣言されている場合、 `@Singleton` が使用されます。

source: If there is a reactive route found on a class with no scope annotation then `@jakarta.inject.Singleton` is added automatically.
ja_jp: スコープアノテーションがないクラスでリアクティブルートが見つかった場合、 `@jakarta.inject.Singleton` が自動的に追加されます。

source: If there is a reactive route found on a class with no scope annotation then `@javax.inject.Singleton` is added automatically.
ja_jp: スコープアノテーションがないクラスでリアクティブルートが見つかった場合、 `@javax.inject.Singleton` が自動的に追加されます。

source: If there is a running coordinator then this is all you need in order to create new LRAs and to enlist participants with them.
ja_jp: コーディネーターがいる場合は、これだけで新しいLRAを作り、参加者を募ることができます。

source: If there is a very good reason for you to implement Authorization Code Flow, then you can configure `OidcClient` as follows:
ja_jp: 認可コードフローを実装する正当な理由がある場合は、 `OidcClient` を次のように設定できます。

source: If there is an immediate need for a test to define Wiremock stubs not currently supported by `OidcWiremockTestResource` one can do so via a `WireMockServer` instance injected into the test class, for example:
ja_jp: 現在 `OidcWiremockTestResource` でサポートされていない Wiremock スタブを定義するテストがすぐに必要な場合は、テストクラスに注入された `WireMockServer` インスタンスを介して行うことができます。次に例を示します。

source: If there is exactly one parameter it's tested for equality.
ja_jp: パラメーターが1つだけの場合、それは等価かがテストされます。

source: If there is more than one bean that matches the required type and qualifiers and is eligible for injection, it is possible to iterate (or stream) available bean instances. Beans returned by both stream and iterator methods are sorted by priority as defined by `io.quarkus.arc.InjectableBean#getPriority()`. Higher priority goes first. If no priority is explicitly declared, 0 is assumed.
ja_jp: 必要なタイプと修飾子に一致し、注入の対象となる Bean が複数ある場合は、使用可能な Bean インスタンスを反復処理 (またはストリーム処理) できます。 ストリームメソッドとイテレーターメソッドの両方で返される Bean は、 `io.quarkus.arc.InjectableBean#getPriority()` で定義された優先順位でソートされます。優先度の高いものが最初に来ます。 優先度が明示的に宣言されていない場合は、0 が想定されます。

source: If there is no CDI scope defined on the declaring class then `@Singleton` is used.
ja_jp: 宣言クラスにCDIスコープが定義されていない場合は、 `@Singleton` が使用されます。

source: If there is no `@Location` qualifier provided, the field name is used to locate the template. In this particular case, we're injecting a template with path `templates/hello.txt`.
ja_jp: `@Location` 修飾子が指定されていない場合は、フィールド名がテンプレートの場所を特定するために使用されます。このケースでは、パスが `templates/hello.txt` であるテンプレートを注入しています。

source: If there is no `@Location` qualifier provided, the field name is used to locate the template. Otherwise, search for the template as the specified location. In this particular case, we will use the `src/main/resources/templates/hello.html` and `src/main/resources/templates/hello.txt` templates to create the message body.
ja_jp: `@Location` 修飾子が指定されていない場合は、フィールド名を使ってテンプレートを探します。それ以外の場合は、指定された場所としてテンプレートを検索します。この例では、 `src/main/resources/templates/hello.html` と `src/main/resources/templates/hello.txt` のテンプレートを使ってメッセージ・ボディを作成します。

source: If there is no `Location` qualifier provided, the field name is used to locate the template. In this particular case, the container will attempt to locate a template with path `src/main/resources/templates/items.html`.
ja_jp: `Location` 修飾子が与えられていない場合は、フィールド名がテンプレートを特定するために使われます。この特定のケースでは、コンテナーはパス `src/main/resources/templates/items.html` でテンプレートを見つけようとします。

source: If there is no namespace defined the class of the first parameter that is not annotated with `@TemplateAttribute` is used to match the base object. Otherwise the namespace is used to match an expression.
ja_jp: 名前空間が定義されていない限り、 `@TemplateAttribute` でアノテーションされた最初のパラメーターのクラスがベース・オブジェクトにマッチするように使用されます。そうでなければ、名前空間が式をマッチするのに使用されます。

source: If there is no namespace defined the class of the first parameter that is not annotated with `@TemplateAttribute` is used to match the base object. Otherwise, the namespace is used to match an expression.
ja_jp: 名前空間が定義されていない限り、`@TemplateAttribute` でアノテーションされた最初のパラメーターのクラスがベース・オブジェクトにマッチするように使用されます。そうでなければ、名前空間が式をマッチするのに使用されます。

source: If there is no scope annotation declared on the resource class then the scope is defaulted. The default scope can be controlled through the `quarkus.resteasy.singleton-resources` property. If set to `true` (default) then a *single instance* of a resource class is created to service all requests (as defined by `@jakarta.inject.Singleton`). If set to `false` then a *new instance* of the resource class is created per each request. An explicit CDI scope annotation (`@RequestScoped`, `@ApplicationScoped`, etc.) always overrides the default behavior and specifies the lifecycle of resource instances.
ja_jp: リソースクラスでスコープアノテーションが宣言されていない場合、スコープはデフォルトとなります。デフォルトのスコープは、 `quarkus.resteasy.singleton-resources` プロパティで制御することができます。 `true` （デフォルト）に設定すると、すべてのリクエストに対応するために、リソースクラスの *単一のインスタンス* が作成されます（ `@jakarta.inject.Singleton` で定義されています）。 `false` に設定された場合、各リクエストごとにリソースクラスの *新しいインスタンス* が作成されます。明示的なCDIスコープアノテーション（ `@RequestScoped` , `@ApplicationScoped` など）は、常にデフォルトの動作を上書きし、リソースインスタンスのライフサイクルを指定します。

source: If there is no scope annotation declared on the resource class then the scope is defaulted. The default scope can be controlled through the `quarkus.resteasy.singleton-resources` property. If set to `true` (default) then a *single instance* of a resource class is created to service all requests (as defined by `@javax.inject.Singleton`). If set to `false` then a *new instance* of the resource class is created per each request. An explicit CDI scope annotation (`@RequestScoped`, `@ApplicationScoped`, etc.) always overrides the default behavior and specifies the lifecycle of resource instances.
ja_jp: リソースクラスでスコープアノテーションが宣言されていない場合は、スコープはデフォルトになります。デフォルトのスコープは `quarkus.resteasy.singleton-resources` プロパティーで制御できます。 `true` (デフォルト) に設定すると、( `@javax.inject.Singleton` で定義されているように) すべてのリクエストにサービスを提供するためのリソースクラスの *単一のインスタンス* が作成されます。 `false` に設定すると、各リクエストごとにリソースクラスの *新しい インスタンス* が作成されます。明示的な CDI スコープアノテーション ( `@RequestScoped` , `@ApplicationScoped` , など) は常にデフォルトの動作を上書きし、リソースインスタンスのライフサイクルを指定します。

source: If there is only one class annotated with `picocli.CommandLine.Command` it will be used as entry point to Picocli CommandLine.
ja_jp: `picocli.CommandLine.Command` でアノテーションされたクラスが 1 つだけある場合、これは Picocli CommandLine のエントリーポイントとして使用されます。

source: If there is only one class annotated with `picocli.CommandLine.Command`, it will be used automatically as the entry point of the command line application.
ja_jp: `picocli.CommandLine.Command` でアノテーションが付けられたクラスが 1 つだけの場合、それがコマンドラインアプリケーションのエントリーポイントとして自動的に使用されます。

source: If there was no /config.xml resource available in the build environment, then a null `RuntimeServiceBuildItem` would be returned and no subsequent logic based on a `RuntimeServiceBuildItem` being produced would execute.
ja_jp: ビルド環境で使用可能な /config.xml リソースがない場合、null の `RuntimeServiceBuildItem` が返され、生成されている `RuntimeServiceBuildItem` に基づく後続のロジックは実行されません。

source: If they need to serialize some data to JSON they will end up creating as many instances of `FastThreadLocal`, resulting on a massive memory consumption as well as exacerbated pressure on the garbage collector. This will eventually affect the performance of the application and inhibit its scalability.
ja_jp: もし、データをJSONにシリアライズする必要がある場合、多数の `FastThreadLocal` のインスタンスを作成することになることから大量のメモリを消費し、ガベージコレクタにかかる負担も大きくなってしまいます。これは最終的にアプリケーションの性能に影響を与え、スケーラビリティを阻害することになります。

source: If this default mechanism is not sufficient and you need a custom locale resolution, you can add additional ``org.hibernate.validator.spi.messageinterpolation.LocaleResolver``s:
ja_jp: このデフォルトのメカニズムでは不十分で、カスタムのロケール解決が必要な場合は、 `org.hibernate.validator.spi.messageinterpolation.LocaleResolver` を追加することができます。

source: If this is a live reload which changed files / classes triggered the reload
ja_jp: ライブリロードで、変更されたファイルやクラスがリロードのきっかけになっているかどうか

source: If this is required it can be configured in the `quarkus-bootstrap-maven-plugin`. Note that if you mark a dependency as parent first then all of its dependencies must also be parent first, or a `LinkageError` can occur.
ja_jp: これが必要な場合は、 `quarkus-bootstrap-maven-plugin` で設定することができます。 依存関係を親優先とマークした場合は、その依存関係もすべて親優先にしなければならないことに注意してください。そうでないと、 `LinkageError` が発生します。

source: If this is required it can be configured in the `quarkus-extension-maven-plugin`. Note that if you mark a dependency as parent first then all of its dependencies must also be parent first, or a `LinkageError` can occur.
ja_jp: 必要であれば、 `quarkus-extension-maven-plugin` で設定することができます。ある依存関係を親優先としてマークした場合、その依存関係もすべて親優先でなければならないことに注意してください。

source: If this is the case in production, consider caching the token introspection and `UserInfo` data for a short period, for example, 3 or 5 minutes.
ja_jp: これが本番環境に当てはまる場合は、トークンイントロスペクションと `UserInfo` データを短期間 (たとえば 3 分から 5 分) キャッシュすることを検討してください。

source: If this is the only key property set, the incoming token is expected to contain only encrypted claims. If either `mp.jwt.verify.publickey` or `mp.jwt.verify.publickey.location` verification properties are also set, then the incoming token is expected to contain the encrypted inner-signed token.
ja_jp: この鍵プロパティのみが設定されている場合、受信トークンには暗号化クレームのみが含まれる必要があります。 `mp.jwt.verify.publickey` または `mp.jwt.verify.publickey.location` のいずれかの検証プロパティーも設定されている場合、受信トークンには暗号化、内部署名付きトークンが含まれている必要があります。

source: If this is the only key property that is set, the incoming token is expected to contain the encrypted claims only. If either `mp.jwt.verify.publickey` or `mp.jwt.verify.publickey.location` verification properties are also set then the incoming token is expected to contain the encrypted inner-signed token.
ja_jp: この鍵プロパティのみが設定されている場合、受信トークンには暗号化クレームのみが含まれることが期待されます。 `mp.jwt.verify.publickey` または `mp.jwt.verify.publickey.location` のいずれかの検証プロパティも設定されている場合、受信トークンには暗号化・内部署名付きトークンが含まれることが期待されます。

source: If this is the only key property which is set then the incoming token is expected to contain the encrypted claims only. If either `mp.jwt.verify.publickey` or `mp.jwt.verify.publickey.location` verification properties are also set then the incoming token is expected to contain the encrypted inner-signed token.
ja_jp: これが設定されている唯一のキープロパティーである場合、受信トークンには暗号化されたクレームのみが含まれていると予想されます。 `mp.jwt.verify.publickey` または `mp.jwt.verify.publickey.location` 検証プロパティーも設定されている場合、受信トークンには暗号化された内部署名トークンが含まれている必要があります。

source: If this is used in an integration test, you should access the class from inside the running process and not from the test class. A viable option could be to expose that data through a REST endpoint method:
ja_jp: これを統合テストで使用する場合、実行中のプロセス内からクラスにアクセスすべきであり、テストクラスからアクセスすべきではありません。実行可能なオプションとして、REST エンドポイントメソッドを介してそのデータを公開する方法があります。

source: If this method is called on a Vert.x context, the processing function is also called on that context. Otherwise, it is called on the sending thread of the producer.
ja_jp: このメソッドが Vert.x コンテキストで呼び出されると、処理関数もそのコンテキストで呼び出されます。 それ以外の場合は、プロデューサーの送信スレッドで呼び出されます。

source: If this property is enabled then a signed token must contain either 'x5t' or 'x5t#S256' X509Certificate thumbprint headers. Verification keys can only be in JWK or PEM Certificate key formats in this case. JWK keys must have a 'x5c' (Base64-encoded X509Certificate) property set.
ja_jp: このプロパティーが有効になっている場合、署名されたトークンには 'x5t' または 'x5t#S256' X509Certificatex5t 拇印ヘッダーが含まれている必要があります。この場合、検証鍵は JWK または PEM 証明書鍵形式でのみ使用できます。JWK 鍵には、'x5c' (Base64 でエンコードされた X509Certificate) プロパティーが設定されている必要があります。

source: If this property is enabled, a signed token must contain either 'x5t' or 'x5t#S256' X509Certificate thumbprint headers. Verification keys can only be in JWK or PEM Certificate key formats. JWK keys must have an 'x5c' (Base64-encoded X509Certificate) property set.
ja_jp: このプロパティーが有効になっている場合、署名されたトークンには、x5t または x5t#S256X509Certificate サムプリントヘッダーが含まれている必要があります。検証鍵は、JWK または PEM 証明書鍵形式でのみ使用できます。JWK 鍵には、x5c (Base64 でエンコードされた X509Certificate) プロパティーセットが必要です。

source: If this property is true, then REST Client will perform a new request that it receives a redirection response from the HTTP server.
ja_jp: このプロパティがtrueの場合、REST Clientは、HTTPサーバーからリダイレクトレスポンスを受信すると、新しいリクエストを実行します。

source: If using <<rest_integration,templates in Jakarta REST resources>>, you can rely on the following convention:
ja_jp: <<rest_integration,templates in Jakarta REST resources>> を使用する場合、次の規則を適用できます。

source: If using Gradle, the path to the binaries in the YAML templates must be changed from `target` to `build`
ja_jp: Gradle を使用している場合、YAML テンプレートのバイナリーへのパスを `target` から `build` に変更しなければなりません。

source: If using Gradle, the path to the binaries in the `manage.sh` must be changed from `target` to `build`
ja_jp: Gradleを使用している場合、 `manage.sh` のバイナリーへのパスを `target` から `build` に変更しなければなりません。

source: If using Powershell , wrap `-D` parameters in double quotes e.g. `"-DprojectArtifactId=debugging-native"`
ja_jp: Powershell を使用する場合は、 `-D` パラメーターを二重引用符で囲みます。例: `"-DprojectArtifactId=debugging-native"`

source: If using Powershell , wrap `-D` parameters in double quotes e.g. `"-DprojectArtifactId=getting-started"`
ja_jp: Powershell を使用する場合は、 `"-DprojectArtifactId=getting-started"` のように `-D` パラメーターを二重引用符で囲みます。

source: If using Powershell, wrap `-D` parameters in double quotes e.g. `"-DprojectArtifactId={create-app-artifact-id}"`
ja_jp: Powershellを使用する場合は、 `-D` パラメータを二重引用符で囲んでください。例: `"-DprojectArtifactId={create-app-artifact-id}"`

source: If using Quarkus REST, a resource method that returns `TemplateInstance` is considered non-blocking. You need to annotate the method with `io.smallrye.common.annotation.Blocking` in order to mark the method as blocking. For example if it's also annotated with `@RunOnVirtualThread`.
ja_jp: Quarkus REST を使用する場合、`TemplateInstance` を返すリソースメソッドはブロッキングではないと見なされます。メソッドをブロッキングとしてマークするには、メソッドにアノテーション `io.smallrye.common.annotation.Blocking` を付ける必要があります。たとえば、`@RunOnVirtualThread` のアノテーションも付けられている場合などです。

source: If using Qute "standalone" you'll need to create an instance of `io.quarkus.qute.Engine` first. The `Engine` represents a central point for template management with dedicated configuration. Let's use the convenient builder:
ja_jp: Quteを"スタンドアロン"で使用する場合は、まず `io.quarkus.qute.Engine` のインスタンスを作成する必要があります。 `Engine` は、専用の設定でテンプレートを管理するための一元的なポイントを表しています。便利なビルダーを使ってみましょう。

source: If using cmd , (don't use backward slash `\` and put everything on the same line)
ja_jp: cmd を使用する場合は、バックスラッシュ `\` は使わず、一行で実行します。

source: If using cmd, (don't use backward slash `\` and put everything on the same line)
ja_jp: cmdを使用する場合、（バックスラッシュ `\` を使用せず、すべてを同じ行に書かないでください）。

source: If using the CLI, you'll probably need to add `-P=io.quarkus:quarkus-bom:999-SNAPSHOT` to the CLI's arguments to use your snapshot of the platform
ja_jp: CLIを使用する場合は、プラットフォームのスナップショットを使用するために、CLIの引数に `-P=io.quarkus:quarkus-bom:999-SNAPSHOT` を追加する必要があるでしょう。

source: If valid configuration is detected (or can be inferred), registration metadata is generated.
ja_jp: 有効な設定が検出された (または推測できる) 場合、登録メタデータが生成されます。

source: If we couldn't use Dev Services and wanted to start a Kafka broker and Apicurio Registry instance manually, we would define a xref:getting-started-testing.adoc#quarkus-test-resource[QuarkusTestResourceLifecycleManager].
ja_jp: Dev Services を使用できず、Kafka ブローカーと Apicurio Registry インスタンスを手動で開始する場合は、xref:getting-started-testing.adoc#quarkus-test-resource[QuarkusTestResourceLifecycleManager] を定義します。

source: If we execute 4 consecutive requests, with results *2,2,3 and 4* this will produce the following output. The `Resource` and `InstrumentationScopeInfo` data are ignored for brevity.
ja_jp: 結果が *2、2、3、4* である 4 つのリクエストを連続して実行すると、次の出力が生成されます。 `Resource` および `InstrumentationScopeInfo` データは無視し、簡素化しています。

source: If we focus on the dependencies section, you can see the extension allowing the development of REST applications:
ja_jp: 依存関係の部分に注目すると、REST アプリケーションの開発を可能にするエクステンションがあることがわかります。

source: If we have a valid pattern, we create a https://www.elastic.co/guide/en/elasticsearch/reference/current/query-dsl-simple-query-string-query.html[`simpleQueryString()`] predicate on the `firstName`, `lastName` and `books.title` fields matching our pattern.
ja_jp: 有効なパターンがあれば、パターンにマッチする `firstName` 、 `lastName` 、 `books.title` フィールドに対する https://www.elastic.co/guide/en/elasticsearch/reference/current/query-dsl-simple-query-string-query.html[`simpleQueryString()`] 述語を作成します。

source: If we have not enabled the OpenTelemetry extension, this extension creates an ID for each request and links it to JFR events as a traceId. In this case, the span ID will be null.
ja_jp: OpenTelemetry エクステンションを有効化していない場合、このエクステンションはリクエストごとに ID を作成し、それを traceId として JFR イベントにリンクします。 この場合、スパン ID は null になります。

source: If we look at this endpoint:
ja_jp: このエンドポイントを見ると、次のようになります。

source: If we modify the project to remove all the Camel Quarkus extensions from the project, change the version of the `quarkus-resteasy-reactive` extension to `2.6.3.Final` and downgrade `quarkus-prettytime` which is not included in the Quarkus platform BOMs to `0.2.0`, `quarkus:update` will report something like:
ja_jp: プロジェクトを変更して、プロジェクトからCamel Quarkusエクステンションをすべて削除し、 `quarkus-resteasy-reactive` エクステンションのバージョンを `2.6.3.Final` 、QuarkusプラットフォームのBOMに含まれていない `quarkus-prettytime` を `0.2.0` にダウングレードすると、 `quarkus:update` は次のような報告をします:
